app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hello world"], ["created_at", "2024-08-23 18:13:35.060292"], ["updated_at", "2024-08-23 18:13:35.060292"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "hello world 3"], ["updated_at", "2024-08-27 19:57:41.871960"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)